{
    "nodes": [
            {
                "id": "2022: The Taliban order women must wear head-to-toe clothing in public. Women in Afghanistan only show only their eyes.",
                "label": "Afghanistan",
                "group": "1",
                "level": "1"
            },
    {
        "id": "Afghanistan",
        "label": "Afghanistan",
        "group": "1",
        "level": "2"
    },
    {
        "id": "2181: There were no gendered clothing restriction and fashion was considered unisex. The upper-class women in the Old Kingdom of Egypt (c. 2613-2181 BCE) wore longer dresses which covered their breasts. Women of the lower classes would have worn the same simple kilt same as men.",
        "label": "Ancient Egypt",
        "group": "2",
        "level": "1"
    },
    {
        "id": "Ancient Egypt",
        "label": "Ancient Egypt",
        "group": "2",
        "level": "2"
    },
    {
        "id": "323: Male magistrates called Controllers of Women were elected to make sure: women didn't spend too much on clothing - looked appropriately chaste and sober in public- and made sure the right outfits were worn during festivals.",
        "label": "Ancient Greece",
        "group": "3",
        "level": "1"
    },
    {
        "id": "700: Women in Greece were forbidden from wearing embroidered robes or jewelry outside-unless they were prostitutes.",
        "label": "Ancient Greece",
        "group": "3",
        "level": "1"
    },
    {
        "id": "Ancient Greece",
        "label": "Ancient Greece",
        "group": "3",
        "level": "2"
    },
    {
        "id": "38: The Roman empress Messalina Valeria led a revolt against Roman dress by wearing Greek clothes herself and by wearing her hair in Greek hairnets and tiaras.",
        "label": "Ancient Rome",
        "group": "4",
        "level": "1"
    },
    {
        "id": "44: Laws forbade women from wearing the toga under any circumstances",
        "label": "Ancient Rome",
        "group": "4",
        "level": "1"
    },
    {
        "id": "200: Women were made to start wearing a floor-length modest gown called the 'stola' as soon as they were married. Up until this period women had been allowed to wear the toga like men but after 200BC it was considered 'disgraceful' for a woman to dress the same way as a man - and was often associated with prostitution or infidelity.",
        "label": "Ancient Rome",
        "group": "4",
        "level": "1"
    },
    {
        "id": "215: Women could not wear more than half an ounce of gold upon their persons and that their tunics should not be in different colours",
        "label": "Ancient Rome",
        "group": "4",
        "level": "1"
    },
    {
        "id": "364: If a man sexually assaulted a woman dressed in the garb of an ancilla (slave girl) or a meretrix (prostitute) it was a lesser legal offense than if a man attacked a woman dressed as a distinguished mater familias (mother of the family).",
        "label": "Ancient Rome",
        "group": "4",
        "level": "1"
    },
    {
        "id": "Ancient Rome",
        "label": "Ancient Rome",
        "group": "4",
        "level": "2"
    },
    {
        "id": "1157: The Council of Reims forbade religious women from wearing habits made of sumptuous fabrics",
        "label": "Austria",
        "group": "5",
        "level": "1"
    },
    {
        "id": "Austria",
        "label": "Austria",
        "group": "5",
        "level": "2"
    },
    {
        "id": "2014: Lacy underwear was banned after regulations were made that undergarments could not contain less than 6 percent of cotton for proper moisture absorption.",
        "label": "Belarus",
        "group": "6",
        "level": "1"
    },
    {
        "id": "Belarus",
        "label": "Belarus",
        "group": "6",
        "level": "2"
    },
    {
        "id": "2011: Belgium implemented bans on full face-covering dress such as the burka or the niqab which covers the lower half of the face.",
        "label": "Belgium",
        "group": "7",
        "level": "1"
    },
    {
        "id": "Belgium",
        "label": "Belgium",
        "group": "7",
        "level": "2"
    },
    {
        "id": "1433: A law was put in place about how women should be dress modestly. Also women were required to cover their hair unless they are young unmarried girls or royalty. Women who didn't were branded as prostitutes",
        "label": "Britain",
        "group": "8",
        "level": "1"
    },
    {
        "id": "1500: The rules around dress code started to change once women started to learn how to read and write. Nicolosa Castellani Sanuti challenged a dress code law by writing a lengthy essay in defense of women's fashion.",
        "label": "Britain",
        "group": "8",
        "level": "1"
    },
    {
        "id": "1600: Queen Elizabeth I passed laws banning native Irish dress and requiring people to dress in civil garments in the English style.",
        "label": "Britain",
        "group": "8",
        "level": "1"
    },
    {
        "id": "1800: For the first time in British history women's dress patterns were allowed to include pockets.",
        "label": "Britain",
        "group": "8",
        "level": "1"
    },
    {
        "id": "1837: Fashion for women made them physically feel restrictive with the metal corsets heavy fabric dresses and hoop skirts. Elizabeth Cady Stanton criticised that women's fashion made women become ladies of leisure there wasn't much you could do when you were wrapped in metal and yards of fabric",
        "label": "Britain",
        "group": "8",
        "level": "1"
    },
    {
        "id": "1890: It was decided in the UK that women must cover their whole bodies in public - necklines were raised to just below the chin and hemlines dropped to below the ankle. Diagrams were released to clarify what length of skirt was suitable for what age",
        "label": "Britain",
        "group": "8",
        "level": "1"
    },
    {
        "id": "Britain",
        "label": "Britain",
        "group": "8",
        "level": "2"
    },
    {
        "id": "900: Women in China began being made to bind their feet during the sixth century it was seen as a symbol of beauty. The Emperor enforced a ruling that all women in his court must make their feet tiny and curved too. The practise continued until 1949.",
        "label": "China",
        "group": "9",
        "level": "1"
    },
    {
        "id": "2014: in Karamay a city in the Xinjiang region of China-home to a population that is around 45 percent Muslim-banned any clothing that seemed too Islamic on public buses. This included the hijab. niqab. burqa (a loose-fitting long garment). Including clothing with the Islamic star-and-crescent symbol. The law warned that perpetrators would be handled by the police.",
        "label": "China",
        "group": "9",
        "level": "1"
    },
    {
        "id": "China",
        "label": "China",
        "group": "9",
        "level": "2"
    },
    {
        "id": "2019: Proposed public decency law would oblige citizens to wear clothing that meets certain standards and to refrain from saying or doing certain things in public areas.",
        "label": "Egypt",
        "group": "10",
        "level": "1"
    },
    {
        "id": "Egypt",
        "label": "Egypt",
        "group": "10",
        "level": "2"
    },
    {
        "id": "1420: A law from 1420 kept Parisian prostitutes from wearing furs and houppelandes that made them resemble honest and bourgeois French women.",
        "label": "France",
        "group": "11",
        "level": "1"
    },
    {
        "id": "1429: Joan of Arc adopted male clothes and this wearing of male dress was included among the charges against her when she was tried by the bishop of Beauvais.",
        "label": "France",
        "group": "11",
        "level": "1"
    },
    {
        "id": "1550: Thick waists are banned from Courts in France. Those attending courts in France were forced to wear corsets made out of wood or whalebone - with guards checking upon entry.",
        "label": "France",
        "group": "11",
        "level": "1"
    },
    {
        "id": "2010: France introduced a burqa ban in 2010 a law that made it illegal for people to cover their faces in public. This was widely criticised for infringing on the people's freedom to dress how they please and this law was discrimintory towards religious mulsim women",
        "label": "France",
        "group": "11",
        "level": "1"
    },
    {
        "id": "2013: Until January 31st of 2013 it was illegal for women in France to wear trousers. It made headlines at the time when a 200 year-old law requiring women to ask police for special permission to dress as men or else risk being taken into custody - was finally revoked.",
        "label": "France",
        "group": "11",
        "level": "1"
    },
    {
        "id": "2016: 20 towns in the south of France decided to ban the 'burkini' and force Muslim women on beaches to remove their headscarves along the coast. Photos emerge of armed police surrounding one woman and forcing her to undress on the beach in front of hundreds of strangers.",
        "label": "France",
        "group": "11",
        "level": "1"
    },
    {
        "id": "France",
        "label": "France",
        "group": "11",
        "level": "2"
    },
    {
        "id": "1056: Women in Germant aren't allowed to wear silver gold or precious stones",
        "label": "Germany",
        "group": "12",
        "level": "1"
    },
    {
        "id": "Germany",
        "label": "Germany",
        "group": "12",
        "level": "2"
    },
    {
        "id": "2009: Greek authorities moved to ban women from wearing stiletto heels at archaeological sites out of fear they would damage the monuments",
        "label": "Greece",
        "group": "13",
        "level": "1"
    },
    {
        "id": "Greece",
        "label": "Greece",
        "group": "13",
        "level": "2"
    },
    {
        "id": "Government regulations that require girls and women to wear the jilbab (clothing apparel that covers the head neck and chest) - this rule is enforced on students and civil servants.",
        "label": "Indonesia",
        "group": "14",
        "level": "1"
    },
    {
        "id": "Indonesia",
        "label": "Indonesia",
        "group": "14",
        "level": "2"
    },
    {
        "id": "1936: Iranian ruler Reza Shah made it illegal for all girls and women to wear the hijab in public",
        "label": "Iran",
        "group": "15",
        "level": "1"
    },
    {
        "id": "1979: Women were banned from appearing in public without a headscarf.",
        "label": "Iran",
        "group": "15",
        "level": "1"
    },
    {
        "id": "Iran",
        "label": "Iran",
        "group": "15",
        "level": "2"
    },
    {
        "id": "2016: Reports emerge from Iraq where ISIS claimed responsibility for stoning women to death because they weren't wearing gloves with their niqabs.",
        "label": "Iraq",
        "group": "16",
        "level": "1"
    },
    {
        "id": "Iraq",
        "label": "Iraq",
        "group": "16",
        "level": "2"
    },
    {
        "id": "1970: Italy has banned full-face coverings under counterterrorism laws since the 1970s.",
        "label": "Italy",
        "group": "17",
        "level": "1"
    },
    {
        "id": "1998: Tthe Italian Supreme Court overturned a rape conviction - because the victim was wearing tight jeans. The defence argued that she must have helped the instructor remove her jeans - making the act consensual. The Italian Supreme Court said 'it is a fact of common experience that it is nearly impossible to slip off tight jeans even partly without the active collaboration of the person who is wearing them.'",
        "label": "Italy",
        "group": "17",
        "level": "1"
    },
    {
        "id": "2010: The mayor of a southern Italian beach town has ordered police officers to fine women who wear short miniskirts or show too much cleavage",
        "label": "Italy",
        "group": "17",
        "level": "1"
    },
    {
        "id": "Italy",
        "label": "Italy",
        "group": "17",
        "level": "2"
    },
    {
        "id": "2014: Lacy underwear was banned in Kazakhstan after regulations were made that undergarments could not contain less than 6 percent of cotton for proper moisture absorption. That same year several women were detained in Kazakhstan after protesting the ban on lace underwear.",
        "label": "Kazakhstan",
        "group": "18",
        "level": "1"
    },
    {
        "id": "Kazakhstan",
        "label": "Kazakhstan",
        "group": "18",
        "level": "2"
    },
    {
        "id": "1941: The Lebanese women's dress code was introduced in 1941 during the French Mandate and requires women to dress in what is perceived to be a modest or conservative manner. The first article of the law bans wearing shorts and the second requires women to cover their necks chests and legs.",
        "label": "Lebanon",
        "group": "19",
        "level": "1"
    },
    {
        "id": "Lebanon",
        "label": "Lebanon",
        "group": "19",
        "level": "2"
    },
    {
        "id": "2500: Used as a means of identifying which women are 'respectable' and which women are 'publicly available' to men. Upper class women in ancient Mesopotamia are made to wear veils that are wrapped loosely over their hair and fall to their waists. Poorer women are not allowed to",
        "label": "Mesopotamia",
        "group": "20",
        "level": "1"
    },
    {
        "id": "Mesopotamia",
        "label": "Mesopotamia",
        "group": "20",
        "level": "2"
    },
    {
        "id": "2017: Moroccan authorities have recently banned the manufacturing marketing and sale of the burqa. It completely conceals the face with a mesh cloth shielding the eyes from view.",
        "label": "Morocco",
        "group": "21",
        "level": "1"
    },
    {
        "id": "Morocco",
        "label": "Morocco",
        "group": "21",
        "level": "2"
    },
    {
        "id": "1919: Writer and activist Luisa Capetillo from Puerto Rico argues publicly that women should have the same rights as men. After wearing a man's suit in public she was sent to jail",
        "label": "Puerto Rico",
        "group": "22",
        "level": "1"
    },
    {
        "id": "Puerto Rico",
        "label": "Puerto Rico",
        "group": "22",
        "level": "2"
    },
    {
        "id": "The first country in Africa to implement a burka ban even though the country has never been targeted with an Islamic terrorist attack. Less than 5% of the population are muslim",
        "label": "Republic of Congo",
        "group": "23",
        "level": "1"
    },
    {
        "id": "Republic of Congo",
        "label": "Republic of Congo",
        "group": "23",
        "level": "2"
    },
    {
        "id": "2014: Lacy underwear was banned in Russia after regulations were made that undergarments could not contain less than 6 percent of cotton for proper moisture absorption.",
        "label": "Russia",
        "group": "24",
        "level": "1"
    },
    {
        "id": "Russia",
        "label": "Russia",
        "group": "24",
        "level": "2"
    },
    {
        "id": "2018: Women are required to dress modestly and this means tight-fitting clothing and see-through materials are generally prohibited.",
        "label": "Saudi",
        "group": "25",
        "level": "1"
    },
    {
        "id": "Saudi",
        "label": "Saudi",
        "group": "25",
        "level": "2"
    },
    {
        "id": "Thirteen women - including journalist Lubna al-Hussein - were arrested in Khartoum because they wore trousers in public.",
        "label": "Sudan",
        "group": "26",
        "level": "1"
    },
    {
        "id": "Sudan",
        "label": "Sudan",
        "group": "26",
        "level": "2"
    },
    {
        "id": "2019: Sweden has begun banning the burka.",
        "label": "Sweden",
        "group": "27",
        "level": "1"
    },
    {
        "id": "Sweden",
        "label": "Sweden",
        "group": "27",
        "level": "2"
    },
    {
        "id": "2020: Law was overturned about women in the chamber being required to be covered up to at least their elbows.",
        "label": "Switzerland",
        "group": "28",
        "level": "1"
    },
    {
        "id": "2021: A vote was passed to ban the Burqa",
        "label": "Switzerland",
        "group": "28",
        "level": "1"
    },
    {
        "id": "2022: Switzerland's government has drafted a new law to issue 990 Swiss franc ($990) fines to women wearing burqas in public.",
        "label": "Switzerland",
        "group": "28",
        "level": "1"
    },
    {
        "id": "Switzerland",
        "label": "Switzerland",
        "group": "28",
        "level": "2"
    },
    {
        "id": "1600: Rich women were required to cover their hair",
        "label": "Turkey",
        "group": "29",
        "level": "1"
    },
    {
        "id": "1970: After Turkey's military coup in 1980 the headscarf was banned in government offices hospitals universities and schools.",
        "label": "Turkey",
        "group": "29",
        "level": "1"
    },
    {
        "id": "2013: Turkish women who want to wear the hijab - the traditional Islamic headscarf covering the head and hair but not the face - to civil service jobs and government offices will be able to do so now that the Turkish government has relaxed its decades-long restriction on wearing the headscarf in state institutions.",
        "label": "Turkey",
        "group": "29",
        "level": "1"
    },
    {
        "id": "Turkey",
        "label": "Turkey",
        "group": "29",
        "level": "2"
    },
    {
        "id": "2013: MPs passed a law to ban women wearing mini skirts this lead to protests.",
        "label": "Uganda",
        "group": "30",
        "level": "1"
    },
    {
        "id": "Uganda",
        "label": "Uganda",
        "group": "30",
        "level": "2"
    },
    {
        "id": "1851: In an act of rebellion from the Victorian fashions feminists began incorporating Bloomers into their wardrobes. The garment was comprised of voluminous Turkish style trousers tied at the ankle and worn under a skirt that fell just below the knees.",
        "label": "US",
        "group": "31",
        "level": "1"
    },
    {
        "id": "1920: Carmel-by- the City a small beach village in California is known for its high heel law/ municipal code which prohibits women from wearing heels that are more than two inches in height.",
        "label": "US",
        "group": "31",
        "level": "1"
    },
    {
        "id": "1920: Women who wore wear trousers were heckled snubbed arrested or fined.",
        "label": "US",
        "group": "31",
        "level": "1"
    },
    {
        "id": "1934: Blue jeans were initially introduced for male laborers to wear to work in 1873. It wasn't until over half a century later in 1934 that Levi Strauss & Co. created the first pair of blue jeans specifically created for women.",
        "label": "US",
        "group": "31",
        "level": "1"
    },
    {
        "id": "1936: Women in New York City were banned from wearing any tops that left their navel exposed in public according to a law in 1936. The ban was lifted almost 50 years later in the '80s. Revealing the midriff has gained popularity since then.",
        "label": "US",
        "group": "31",
        "level": "1"
    },
    {
        "id": "1942: While men's clothing remained the same the USA introduced 'Regulation L85' which set skirt lengths at 17 inches above the floor - no longer and no shorter. At the same time material for swimwear was restricted - so swimming costumes become smaller as a result. Within two years the bikini had made its debut - but came accompanied by a the rule that women shouldn't show their belly buttons.",
        "label": "US",
        "group": "31",
        "level": "1"
    },
    {
        "id": "1950: Dressing more masculine let a woman join her office with less of a push-back but while she had to dress authoritative she still had to dress womanly. A study in 1985 found that female interview candidates that dressed more masculine were significantly viewed as better for the position",
        "label": "US",
        "group": "31",
        "level": "1"
    },
    {
        "id": "1993: Senator Barbara Mikulski became the first woman to wear pants on the senate floor that the style was acceptable for women in politics.",
        "label": "US",
        "group": "31",
        "level": "1"
    },
    {
        "id": "2022: Capitol Hill has its share of anti-feminist rules. Just this summer a reporter was not permitted into a room adjacent to the House's chambers because her shoulders were not covered. Men are expected to wear suit jackets to Congress and women are not allowed to wear sleeveless blouses or dresses or sneakers or open-toed shoes.",
        "label": "US",
        "group": "31",
        "level": "1"
    },
    {
        "id": "2022: In Cleveland Ohio it is illegal for women to show too much cleavage as the city prohibits women from showing cleavage with a less than fully opaque covering.",
        "label": "US",
        "group": "31",
        "level": "1"
    },
    {
        "id": "2023: Missouri House of Representative enforced a stricter dress code requiring women to cover their shoulders.",
        "label": "US",
        "group": "31",
        "level": "1"
    },
    {
        "id": "US",
        "label": "US",
        "group": "31",
        "level": "2"
    },
    {
        "id": "2001: chiefs from the island of Paama in Vanuatu banned women from wearing shorts or pants in public. They claimed both articles of clothing were too revealing and could potentially incite rape and adultery.",
        "label": "Vanuatu",
        "group": "32",
        "level": "1"
    },
    {
        "id": "Vanuatu",
        "label": "Vanuatu",
        "group": "32",
        "level": "2"
    }

],


"links": [

        {
            "source": "1056: Women in Germant aren't allowed to wear silver gold or precious stones",
            "target": "Germany",
            "value": "1"
        },
        {
            "source": "1157: The Council of Reims forbade religious women from wearing habits made of sumptuous fabrics",
            "target": "Austria",
            "value": "1"
        },
        {
            "source": "1420: A law from 1420 kept Parisian prostitutes from wearing furs and houppelandes that made them resemble honest and bourgeois French women.",
            "target": "France",
            "value": "1"
        },
        {
            "source": "1429: Joan of Arc adopted male clothes and this wearing of male dress was included among the charges against her when she was tried by the bishop of Beauvais.",
            "target": "France",
            "value": "1"
        },
        {
            "source": "1433: A law was put in place about how women should be dress modestly. Also women were required to cover their hair unless they are young unmarried girls or royalty. Women who didn't were branded as prostitutes",
            "target": "Britain",
            "value": "1"
        },
        {
            "source": "1500: The rules around dress code started to change once women started to learn how to read and write. Nicolosa Castellani Sanuti challenged a dress code law by writing a lengthy essay in defense of women's fashion.",
            "target": "Britain",
            "value": "1"
        },
        {
            "source": "1550: Thick waists are banned from Courts in France. Those attending courts in France were forced to wear corsets made out of wood or whalebone - with guards checking upon entry.",
            "target": "France",
            "value": "1"
        },
        {
            "source": "1600: Queen Elizabeth I passed laws banning native Irish dress and requiring people to dress in civil garments in the English style.",
            "target": "Britain",
            "value": "1"
        },
        {
            "source": "1600: Rich women were required to cover their hair",
            "target": "Turkey",
            "value": "1"
        },
        {
            "source": "1800: For the first time in British history women's dress patterns were allowed to include pockets.",
            "target": "Britain",
            "value": "1"
        },
        {
            "source": "1837: Fashion for women made them physically feel restrictive with the metal corsets heavy fabric dresses and hoop skirts. Elizabeth Cady Stanton criticised that women's fashion made women become ladies of leisure there wasn't much you could do when you were wrapped in metal and yards of fabric",
            "target": "Britain",
            "value": "1"
        },
        {
            "source": "1851: In an act of rebellion from the Victorian fashions feminists began incorporating Bloomers into their wardrobes. The garment was comprised of voluminous Turkish style trousers tied at the ankle and worn under a skirt that fell just below the knees.",
            "target": "US",
            "value": "1"
        },
        {
            "source": "1890: It was decided in the UK that women must cover their whole bodies in public - necklines were raised to just below the chin and hemlines dropped to below the ankle. Diagrams were released to clarify what length of skirt was suitable for what age",
            "target": "Britain",
            "value": "1"
        },
        {
            "source": "1919: Writer and activist Luisa Capetillo from Puerto Rico argues publicly that women should have the same rights as men. After wearing a man's suit in public she was sent to jail",
            "target": "Puerto Rico",
            "value": "1"
        },
        {
            "source": "1920: Carmel-by- the City a small beach village in California is known for its high heel law/ municipal code which prohibits women from wearing heels that are more than two inches in height.",
            "target": "US",
            "value": "1"
        },
        {
            "source": "1920: Women who wore wear trousers were heckled snubbed arrested or fined.",
            "target": "US",
            "value": "1"
        },
        {
            "source": "1934: Blue jeans were initially introduced for male laborers to wear to work in 1873. It wasn't until over half a century later in 1934 that Levi Strauss & Co. created the first pair of blue jeans specifically created for women.",
            "target": "US",
            "value": "1"
        },
        {
            "source": "1936: Iranian ruler Reza Shah made it illegal for all girls and women to wear the hijab in public",
            "target": "Iran",
            "value": "1"
        },
        {
            "source": "1936: Women in New York City were banned from wearing any tops that left their navel exposed in public according to a law in 1936. The ban was lifted almost 50 years later in the '80s. Revealing the midriff has gained popularity since then.",
            "target": "US",
            "value": "1"
        },
        {
            "source": "1941: The Lebanese women's dress code was introduced in 1941 during the French Mandate and requires women to dress in what is perceived to be a modest or conservative manner. The first article of the law bans wearing shorts and the second requires women to cover their necks chests and legs.",
            "target": "Lebanon",
            "value": "1"
        },
        {
            "source": "1942: While men's clothing remained the same the USA introduced 'Regulation L85' which set skirt lengths at 17 inches above the floor - no longer and no shorter. At the same time material for swimwear was restricted - so swimming costumes become smaller as a result. Within two years the bikini had made its debut - but came accompanied by a the rule that women shouldn't show their belly buttons.",
            "target": "US",
            "value": "1"
        },
        {
            "source": "1950: Dressing more masculine let a woman join her office with less of a push-back but while she had to dress authoritative she still had to dress womanly. A study in 1985 found that female interview candidates that dressed more masculine were significantly viewed as better for the position",
            "target": "US",
            "value": "1"
        },
        {
            "source": "2023: Missouri House of Representative enforced a stricter dress code requiring women to cover their shoulders.",
            "target": "US",
            "level": "1"
        },
        {
            "source": "1970: After Turkey's military coup in 1980 the headscarf was banned in government offices hospitals universities and schools.",
            "target": "Turkey",
            "value": "1"
        },
        {
            "source": "1970: Italy has banned full-face coverings under counterterrorism laws since the 1970s.",
            "target": "Italy",
            "value": "1"
        },
        {
            "source": "1979: Women were banned from appearing in public without a headscarf.",
            "target": "Iran",
            "value": "1"
        },
        {
            "source": "1993: Senator Barbara Mikulski became the first woman to wear pants on the senate floor that the style was acceptable for women in politics.",
            "target": "US",
            "value": "1"
        },
        {
            "source": "1998: Tthe Italian Supreme Court overturned a rape conviction - because the victim was wearing tight jeans. The defence argued that she must have helped the instructor remove her jeans - making the act consensual. The Italian Supreme Court said 'it is a fact of common experience that it is nearly impossible to slip off tight jeans even partly without the active collaboration of the person who is wearing them.'",
            "target": "Italy",
            "value": "1"
        },
        {
            "source": "2001: chiefs from the island of Paama in Vanuatu banned women from wearing shorts or pants in public. They claimed both articles of clothing were too revealing and could potentially incite rape and adultery.",
            "target": "Vanuatu",
            "value": "1"
        },
        {
            "source": "2009: Greek authorities moved to ban women from wearing stiletto heels at archaeological sites out of fear they would damage the monuments",
            "target": "Greece",
            "value": "1"
        },
        {
            "source": "Thirteen women - including journalist Lubna al-Hussein - were arrested in Khartoum because they wore trousers in public.",
            "target": "Sudan",
            "value": "1"
        },
        {
            "source": "200: Women were made to start wearing a floor-length modest gown called the 'stola' as soon as they were married. Up until this period women had been allowed to wear the toga like men but after 200BC it was considered 'disgraceful' for a woman to dress the same way as a man - and was often associated with prostitution or infidelity.",
            "target": "Ancient Rome",
            "value": "1"
        },
        {
            "source": "2010: France introduced a burqa ban in 2010 a law that made it illegal for people to cover their faces in public. This was widely criticised for infringing on the people's freedom to dress how they please and this law was discrimintory towards religious mulsim women",
            "target": "France",
            "value": "1"
        },
        {
            "source": "2010: The mayor of a southern Italian beach town has ordered police officers to fine women who wear short miniskirts or show too much cleavage",
            "target": "Italy",
            "value": "1"
        },
        {
            "source": "2011: Belgium implemented bans on full face-covering dress such as the burka or the niqab which covers the lower half of the face.",
            "target": "Belgium",
            "value": "1"
        },
        {
            "source": "2013: MPs passed a law to ban women wearing mini skirts this lead to protests.",
            "target": "Uganda",
            "value": "1"
        },
        {
            "source": "2013: Turkish women who want to wear the hijab - the traditional Islamic headscarf covering the head and hair but not the face - to civil service jobs and government offices will be able to do so now that the Turkish government has relaxed its decades-long restriction on wearing the headscarf in state institutions.",
            "target": "Turkey",
            "value": "1"
        },
        {
            "source": "2013: Until January 31st of 2013 it was illegal for women in France to wear trousers. It made headlines at the time when a 200 year-old law requiring women to ask police for special permission to dress as men or else risk being taken into custody - was finally revoked.",
            "target": "France",
            "value": "1"
        },
        {
            "source": "2014: in Karamay a city in the Xinjiang region of China-home to a population that is around 45 percent Muslim-banned any clothing that seemed too Islamic on public buses. This included the hijab. niqab. burqa (a loose-fitting long garment). Including clothing with the Islamic star-and-crescent symbol. The law warned that perpetrators would be handled by the police.",
            "target": "China",
            "value": "1"
        },
        {
            "source": "2014: Lacy underwear was banned after regulations were made that undergarments could not contain less than 6 percent of cotton for proper moisture absorption.",
            "target": "Belarus",
            "value": "1"
        },
        {
            "source": "2014: Lacy underwear was banned in Kazakhstan after regulations were made that undergarments could not contain less than 6 percent of cotton for proper moisture absorption. That same year several women were detained in Kazakhstan after protesting the ban on lace underwear.",
            "target": "Kazakhstan",
            "value": "1"
        },
        {
            "source": "2014: Lacy underwear was banned in Russia after regulations were made that undergarments could not contain less than 6 percent of cotton for proper moisture absorption.",
            "target": "Russia",
            "value": "1"
        },
        {
            "source": "The first country in Africa to implement a burka ban even though the country has never been targeted with an Islamic terrorist attack. Less than 5% of the population are muslim",
            "target": "Republic of Congo",
            "value": "1"
        },
        {
            "source": "2016: 20 towns in the south of France decided to ban the 'burkini' and force Muslim women on beaches to remove their headscarves along the coast. Photos emerge of armed police surrounding one woman and forcing her to undress on the beach in front of hundreds of strangers.",
            "target": "France",
            "value": "1"
        },
        {
            "source": "2016: Reports emerge from Iraq where ISIS claimed responsibility for stoning women to death because they weren't wearing gloves with their niqabs.",
            "target": "Iraq",
            "value": "1"
        },
        {
            "source": "2017: Moroccan authorities have recently banned the manufacturing marketing and sale of the burqa. It completely conceals the face with a mesh cloth shielding the eyes from view.",
            "target": "Morocco",
            "value": "1"
        },
        {
            "source": "2018: Women are required to dress modestly and this means tight-fitting clothing and see-through materials are generally prohibited.",
            "target": "Saudi",
            "value": "1"
        },
        {
            "source": "2019: Proposed public decency law would oblige citizens to wear clothing that meets certain standards and to refrain from saying or doing certain things in public areas.",
            "target": "Egypt",
            "value": "1"
        },
        {
            "source": "2019: Sweden has begun banning the burka.",
            "target": "Sweden",
            "value": "1"
        },
        {
            "source": "2020: Law was overturned about women in the chamber being required to be covered up to at least their elbows.",
            "target": "Switzerland",
            "value": "1"
        },
        {
            "source": "2021: A vote was passed to ban the Burqa",
            "target": "Switzerland",
            "value": "1"
        },
        {
            "source": "Government regulations that require girls and women to wear the jilbab (clothing apparel that covers the head neck and chest) - this rule is enforced on students and civil servants.",
            "target": "Indonesia",
            "value": "1"
        },
        {
            "source": "2022: Capitol Hill has its share of anti-feminist rules. Just this summer a reporter was not permitted into a room adjacent to the House's chambers because her shoulders were not covered. Men are expected to wear suit jackets to Congress and women are not allowed to wear sleeveless blouses or dresses or sneakers or open-toed shoes.",
            "target": "US",
            "value": "1"
        },
        {
            "source": "2022: In Cleveland Ohio it is illegal for women to show too much cleavage as the city prohibits women from showing cleavage with a less than fully opaque covering.",
            "target": "US",
            "value": "1"
        },
        {
            "source": "2022: Switzerland's government has drafted a new law to issue 990 Swiss franc ($990) fines to women wearing burqas in public.",
            "target": "Switzerland",
            "value": "1"
        },
        {
            "source": "2022: The Taliban order women must wear head-to-toe clothing in public. Women in Afghanistan only show only their eyes.",
            "target": "Afghanistan",
            "value": "1"
        },
        {
            "source": "215: Women could not wear more than half an ounce of gold upon their persons and that their tunics should not be in different colours",
            "target": "Ancient Rome",
            "value": "1"
        },
        {
            "source": "2181: There were no gendered clothing restriction and fashion was considered unisex. The upper-class women in the Old Kingdom of Egypt (c. 2613-2181 BCE) wore longer dresses which covered their breasts. Women of the lower classes would have worn the same simple kilt same as men.",
            "target": "Ancient Egypt",
            "value": "1"
        },
        {
            "source": "2500: Used as a means of identifying which women are 'respectable' and which women are 'publicly available' to men. Upper class women in ancient Mesopotamia are made to wear veils that are wrapped loosely over their hair and fall to their waists. Poorer women are not allowed to",
            "target": "Mesopotamia",
            "value": "1"
        },
        {
            "source": "323: Male magistrates called Controllers of Women were elected to make sure: women didn't spend too much on clothing - looked appropriately chaste and sober in public- and made sure the right outfits were worn during festivals.",
            "target": "Ancient Greece",
            "value": "1"
        },
        {
            "source": "364: If a man sexually assaulted a woman dressed in the garb of an ancilla (slave girl) or a meretrix (prostitute) it was a lesser legal offense than if a man attacked a woman dressed as a distinguished mater familias (mother of the family).",
            "target": "Ancient Rome",
            "value": "1"
        },
        {
            "source": "38: The Roman empress Messalina Valeria led a revolt against Roman dress by wearing Greek clothes herself and by wearing her hair in Greek hairnets and tiaras.",
            "target": "Ancient Rome",
            "value": "1"
        },
        {
            "source": "44: Laws forbade women from wearing the toga under any circumstances",
            "target": "Ancient Rome",
            "value": "1"
        },
        {
            "source": "700: Women in Greece were forbidden from wearing embroidered robes or jewelry outside-unless they were prostitutes.",
            "target": "Ancient Greece",
            "value": "1"
        },
        {
            "source": "900: Women in China began being made to bind their feet during the sixth century it was seen as a symbol of beauty. The Emperor enforced a ruling that all women in his court must make their feet tiny and curved too. The practise continued until 1949.",
            "target": "China",
            "value": "1"
        },
        {
            "source": "Afghanistan",
            "target": "Afghanistan",
            "value": "1"
        },
        {
            "source": "Ancient Egypt",
            "target": "Ancient Egypt",
            "value": "1"
        },
        {
            "source": "Ancient Greece",
            "target": "Ancient Greece",
            "value": "1"
        },
        {
            "source": "Ancient Rome",
            "target": "Ancient Rome",
            "value": "1"
        },
        {
            "source": "Austria",
            "target": "Austria",
            "value": "1"
        },
        {
            "source": "Belarus",
            "target": "Belarus",
            "value": "1"
        },
        {
            "source": "Belgium",
            "target": "Belgium",
            "value": "1"
        },
        {
            "source": "Britain",
            "target": "Britain",
            "value": "1"
        },
        {
            "source": "China",
            "target": "China",
            "value": "1"
        },
        {
            "source": "Egypt",
            "target": "Egypt",
            "value": "1"
        },
        {
            "source": "France",
            "target": "France",
            "value": "1"
        },
        {
            "source": "Germany",
            "target": "Germany",
            "value": "1"
        },
        {
            "source": "Greece",
            "target": "Greece",
            "value": "1"
        },
        {
            "source": "Indonesia",
            "target": "Indonesia",
            "value": "1"
        },
        {
            "source": "Iran",
            "target": "Iran",
            "value": "1"
        },
        {
            "source": "Iraq",
            "target": "Iraq",
            "value": "1"
        },
        {
            "source": "Italy",
            "target": "Italy",
            "value": "1"
        },
        {
            "source": "Kazakhstan",
            "target": "Kazakhstan",
            "value": "1"
        },
        {
            "source": "Lebanon",
            "target": "Lebanon",
            "value": "1"
        },
        {
            "source": "Mesopotamia",
            "target": "Mesopotamia",
            "value": "1"
        },
        {
            "source": "Morocco",
            "target": "Morocco",
            "value": "1"
        },
        {
            "source": "Puerto Rico",
            "target": "Puerto Rico",
            "value": "1"
        },
        {
            "source": "Republic of Congo",
            "target": "Republic of Congo",
            "value": "1"
        },
        {
            "source": "Russia",
            "target": "Russia",
            "value": "1"
        },
        {
            "source": "Saudi",
            "target": "Saudi",
            "value": "1"
        },
        {
            "source": "Sudan",
            "target": "Sudan",
            "value": "1"
        },
        {
            "source": "Sweden",
            "target": "Sweden",
            "value": "1"
        },
        {
            "source": "Switzerland",
            "target": "Switzerland",
            "value": "1"
        },
        {
            "source": "Turkey",
            "target": "Turkey",
            "value": "1"
        },
        {
            "source": "US",
            "target": "US",
            "value": "1"
        },
        {
            "source": "Uganda",
            "target": "Uganda",
            "value": "1"
        },
        {
            "source": "Vanuatu",
            "target": "Vanuatu",
            "value": "1"
        }

]

}
    
